Tim-Peck/Team-Rocket/MSP430 Code/timer.c
#include <msp430.h>
#include <inttypes.h>
#include "timer.h"
#include "GNSS.h" // need to include .h in .c file if you want to use

#define CCR0VALUE 20000

void timerB0_init() // CHANGE FOR FR2355
{
    // stop timer
    TB0CTL &= ~(MC0 | MC1);

    // note: TBSSEL1 is control bit for second TBSSEL bit (so select SMCLK)
    // note: TAR has max 2^16 - 1 = 65535 so to count to 1 second with 1MHz clock, we can divide by 32 (ID divide by 8, TBIDEX divide by 4) to get 32768Hz which we set as our CCR0 for 1Hz
    TB0CCR0 = 33040; // modified from 32768 to get 1Hz
    TB0CTL |= TBSSEL1 | ID1 | ID0;
    TB0EX0 |= TBIDEX0 | TBIDEX1;
    // enable CCR0 interrupt
    TB0CCTL0 |= CCIE;

    // clear timer
    TB0CTL |= TBCLR;
    // clear flag
    TB0CCTL0 &= ~CCIFG;
}

void begin1HzTimer() // CHANGE FOR FR2355
{
    // start timer in up mode
    TB0CTL |= MC0;

//    P1DIR |= BIT0; // TESTING
}

// IFG for CCR0: 1Hz timer for flight logic
#pragma vector=TIMER0_B0_VECTOR // CHANGE FOR FR2355
__interrupt void TIMER0_B0_ISR(void)
{
//    P1OUT ^= BIT0; // TESTING
}

void timerB3_init()
{
    // set LED pins (LAUNCHPAD 2355)
    P1DIR |= BIT0;
    P6DIR |= BIT6;

    // P2DIR |= BIT1; // red
    // P2DIR |= BIT2; // green
    // P2DIR |= BIT3; // blue

    // stop timer
    TB3CTL &= ~(MC0 | MC1);

    // timer B1 clock at default SMCLK clock speed of 1MHz
    TB3CTL |= TBSSEL1;

    // enable CC interrupts
    TB3CCTL0 |= CCIE; // counts to CCR0
    // enable compare registers for duty cycle/width of pulse
    TB3CCTL1 |= CCIE;
    TB3CCTL2 |= CCIE;
    // TB3CCTL3 |= CCIE; // uncomment for actual

    // set CCR0 compare value for cycle period
    TB3CCR0 = CCR0VALUE;

    // clear timer
    TB3CTL |= TBCLR;
    // clear flags
    TB3CCTL0 &= ~CCIFG;
    TB3CCTL1 &= ~CCIFG;
    TB3CCTL2 &= ~CCIFG;
    //TB1CCTL3 &= ~CCIFG;
}

void rgbLED(uint8_t redVal, uint8_t greenVal, uint8_t blueVal)
{
    // stop timer
    TB3CTL &= ~(MC0 | MC1);

    // check values for edge cases 0 or 255 to disable respective interrupts
    if (redVal == 255)
    {
        TB3CCTL1 &= ~CCIE;
    }
    else
    {
        TB3CCTL1 |= CCIE;
    }
    if (greenVal == 255)
    {
        TB3CCTL2 &= ~CCIE;
    }
    else
    {
        TB3CCTL2 |= CCIE;
    }
//    if (blueVal == 255)
//    {
//        TB3CCTL3 &= ~CCIE;
//    }
//    else
//    {
//        TB3CCTL3 |= CCIE;
//    }

    // set duty cycle of each LED
    TB3CCR1 = (uint16_t) (CCR0VALUE * (float) redVal / 255);
    TB3CCR2 = (uint16_t) (CCR0VALUE * (float) greenVal / 255);
    // TB1CCR3 = (uint16_t)(1000 * (float)blueVal/255);

    // clear timer
    TB3CTL |= TBCLR;

    // start timer in up mode
    TB3CTL |= MC0;
}

// CCR0: set all LED
#pragma vector=TIMER3_B0_VECTOR
__interrupt void TIMER3_B0_ISR(void)
{
    P1OUT |= BIT0;
    P6OUT |= BIT6;

    // P2OUT|= BIT1 | BIT2 | BIT3; // actual RGB pins
}

// CCR1/2/3 IFG: reset respective LED (sets duty cycle)
#pragma vector=TIMER3_B1_VECTOR
__interrupt void TIMER3_B1_ISR(void)
{
    switch (TB3IV)
    {
    case TBIV__TBCCR1:
        P1OUT &= ~BIT0;
//        P2OUT &= ~BIT1;
        break;
    case TBIV__TBCCR2:
        P6OUT &= ~BIT6;
//        P2OUT &= ~BIT2;
        break;
        //case TBIV__TBCCR3:
        //P2OUT &= ~BIT3
        //break;
    default:
        break;
    }
}

uint32_t convert_uint8_array_to_uint32(uint8_t *arr)
{
    uint32_t num = 0;

    // combine the four uint8_t bytes into a single uint32_t variable using bitwise operations
    num |= ((uint32_t) arr[0]) << 24;
    num |= ((uint32_t) arr[1]) << 16;
    num |= ((uint32_t) arr[2]) << 8;
    num |= (uint32_t) arr[3];

    return num;
}

void convert_uint32_to_uint8_array(uint32_t num, uint8_t *arr)
{
    // note, this is little endian
    memcpy(arr, &num, sizeof(uint32_t)); // note num is a copy but it doesn't matter as it still contains the same values
}
